## DataFrame에서 데이터 추출

 - 열(컬럼 column 세로백터) 단위 데이터 추출
    - 방식 :  df객체변수명.[컬럼명], 또는 df객체변수명.컬럼명
 - 행(로우 row 가로백터) 단위 데이터 추출
    - 방식 : df객체변수명.loc[인덱스라벨] 또는 df객체변수명.iloc[정수인덱스]
 - 원소 단위 데이터 추출
    - 방식 : df객체변수명.loc[행인덱스라벨, 열인덱스라벨] 또는 [행인덱스라벨][열인덱스라벨]  
     df 객체변수명.iloc[행인덱스, 열인덱스] 또는 [행인덱스][열인덱스]

In [3]:
# 모듈 로딩
import pandas as pd

# df객체 생성
df = pd.DataFrame([[1, 2, 3], [11, 22, 33], [111, 222, 333]])

# df객체 요약정보 출력 메서드
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       3 non-null      int64
 2   2       3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes

In [4]:
# df객체 구성 확인
df

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333

### 열 데이터 추출 -------------------------

In [5]:
# df 객체변수명[컬럼명]
oneCol = df[0]

print(f"oneCol => \n{oneCol}", "\n", f"oneCol Type => {type(oneCol)}")

oneCol =>
0      1
1     11
2    111
Name: 0, dtype: int64
 oneCol Type => <class 'pandas.core.series.Series'>

In [6]:
twoCol = df[0:2]

print(f"twoCol => \n{twoCol}", "\n", f"twoCol Type => {type(twoCol)}")

twoCol =>
    0   1   2
0   1   2   3
1  11  22  33
 twoCol Type => <class 'pandas.core.frame.DataFrame'>

In [7]:
df.columns

RangeIndex(start=0, stop=3, step=1)

### 행 데이터 추출 ----------------------------

In [8]:
df

     0    1    2
0    1    2    3
1   11   22   33
2  111  222  333

In [9]:
oneRow = df.iloc[1]
print(oneRow)
print(type(oneRow))

0    11
1    22
2    33
Name: 1, dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
df.index = ["one", "two", "three"]
print(df)

df.loc["two"]

twoRow = df.loc["one":"two"]
print(twoRow)
print(type(twoRow))

         0    1    2
one      1    2    3
two     11   22   33
three  111  222  333
      0   1   2
one   1   2   3
two  11  22  33
<class 'pandas.core.frame.DataFrame'>

### 연습 ---------------------------------

In [11]:
exam_data = {"수학": [90, 80, 70], "국어": [100, 91, 77], "영어": [60, 85, 97]}
df2 = pd.DataFrame(exam_data, index=["인욱", "서준", "동석"])
df2

    수학   국어  영어
인욱  90  100  60
서준  80   91  85
동석  70   77  97

#### 동석 학생의 데이터만 추출

In [12]:
dong = df2.loc["동석"]
print(dong)
# 인욱 학생
inuk = df2.iloc[0]
print(inuk)

수학    70
국어    77
영어    97
Name: 동석, dtype: int64
수학     90
국어    100
영어     60
Name: 인욱, dtype: int64

#### 영어 과목의 데이터만 추출

In [13]:
eng = df2["영어"]
print(eng)

math = df2.수학
print(math)

인욱    60
서준    85
동석    97
Name: 영어, dtype: int64
인욱    90
서준    80
동석    70
Name: 수학, dtype: int64

#### 서준 학생의 국어 데이터만 추출

In [14]:
print(df2)
print(df2.loc["서준", "국어"])
sg = df2.iloc[1, 1]
print(f"서준 국어 = {sg}, type = {type(sg)}")

    수학   국어  영어
인욱  90  100  60
서준  80   91  85
동석  70   77  97
91
서준 국어 = 91, type = <class 'numpy.int64'>

## DF에 행과 열 추가하기
- 행 추가 => df.loc[행라벨] = 데이터
- 열 추가 => df.[컬럼] = 데이터

In [15]:
# df데이터 확인
df2

    수학   국어  영어
인욱  90  100  60
서준  80   91  85
동석  70   77  97

In [16]:
# 행(row) 추가하기 ------------------
df2.loc["혜진"] = [100, 90, 70]
df2

     수학   국어  영어
인욱   90  100  60
서준   80   91  85
동석   70   77  97
혜진  100   90  70

In [17]:
df2.loc["나령"] = 100
df2

     수학   국어   영어
인욱   90  100   60
서준   80   91   85
동석   70   77   97
혜진  100   90   70
나령  100  100  100

In [18]:
# 열(column) 추가하기 -----------------------------
df2["음악"] = [80, 60, 50, 90, 100]
df2

     수학   국어   영어   음악
인욱   90  100   60   80
서준   80   91   85   60
동석   70   77   97   50
혜진  100   90   70   90
나령  100  100  100  100

## DF에서 행과 열 삭제하기
- 삭제 관련 메서드 =>  drop(행)
    - 행 삭제 : df.drop(row, axis = 0)  # defalt = 행
    - 열 삭제 : df.drop(column, axis = 1)
- drop() 특징
    - 실제 데이터 삭제하지 않음
    - 복사본에서 데이터 삭제하고 복사본 반환
    - 실제 데이터 삭제하기 -> inplace = True

In [19]:
df2

     수학   국어   영어   음악
인욱   90  100   60   80
서준   80   91   85   60
동석   70   77   97   50
혜진  100   90   70   90
나령  100  100  100  100

In [20]:
# 동석 학생 성적 제거 --------------------
df3 = df2.drop("동석")

In [21]:
df2

     수학   국어   영어   음악
인욱   90  100   60   80
서준   80   91   85   60
동석   70   77   97   50
혜진  100   90   70   90
나령  100  100  100  100

In [22]:
df3

     수학   국어   영어   음악
인욱   90  100   60   80
서준   80   91   85   60
혜진  100   90   70   90
나령  100  100  100  100

In [23]:
try:
    df2.drop("서준", inplace=True)
    df2
except Exception:
    df2

In [24]:
df2

     수학   국어   영어   음악
인욱   90  100   60   80
동석   70   77   97   50
혜진  100   90   70   90
나령  100  100  100  100

In [25]:
df4 = df2.drop("수학", axis=1)
df4

     국어   영어   음악
인욱  100   60   80
동석   77   97   50
혜진   90   70   90
나령  100  100  100

## 행 & 열 전환 -----------------
- 행 ==> 열, 열 ==> 행 으로 변환
- 방법
    - 메서드 : df.transpose()
    - 속성 : df.T

In [26]:
df4

     국어   영어   음악
인욱  100   60   80
동석   77   97   50
혜진   90   70   90
나령  100  100  100

In [27]:
# df 객체의 형태 =>
df4.shape

(4, 3)

In [34]:
# 행 => 열 전환
df4 = df4.transpose()
df4

     국어   영어   음악
인욱  100   60   80
동석   77   97   50
혜진   90   70   90
나령  100  100  100